package oop1_exercise_3;

//Завдання 3
//        Використовуючи IDEA, створіть проєкт із пакетом.
//        Потрібно: створити клас Book (Main). Створити класи Title, Author та Content, кожен з яких має містити
//        одне рядкове поле та метод void show(). Реалізуйте можливість додавання до книги назви книги, імені
//        автора та змісту. Виведіть на екран за допомогою методу show() назву книги, ім'я автора та зміст.

public class Book_Main {
    public static void main(String[] args) {

        Title title = new Title();
        title.setTitle("Аліса в Країні Див");

        Author author = new Author("Льюїс Керрол");

        Content content = new Content("""
                Маленька Аліса опиняється у казковому світі, де мешкають шахові королі\s
                та королеви, говіркі тварини та химерні істоти, що співають дивних пісень.\s
                Спочатку дівчинка боїться їх, та невдовзі щиро приязниться і нісенітниці набувають для неї сенсу.""");
        title.show();
        author.show();
        content.show();
    }
}
